dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxCan_reg.h
/** \brief 6C0, Tx Buffer Configuration 1 */
#define CAN0_N1_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02086C0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BC.
* To use register names with standard convension, please use CAN0_N1_TX_BC.
*/
#define CAN0_TXBC1 (CAN0_N1_TX_BC)

/** \brief 6C4, Tx FIFO/Queue Status 1 */
#define CAN0_N1_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02086C4u)
/** Alias (User Manual Name) for CAN0_N1_TX_FQS.
* To use register names with standard convension, please use CAN0_N1_TX_FQS.
*/
#define CAN0_TXFQS1 (CAN0_N1_TX_FQS)

/** \brief 6C8, Tx Buffer Element Size Configuration 1 */
#define CAN0_N1_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02086C8u)
/** Alias (User Manual Name) for CAN0_N1_TX_ESC.
* To use register names with standard convension, please use CAN0_N1_TX_ESC.
*/
#define CAN0_TXESC1 (CAN0_N1_TX_ESC)

/** \brief 6CC, Tx Buffer Request Pending 1 */
#define CAN0_N1_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02086CCu)
/** Alias (User Manual Name) for CAN0_N1_TX_BRP.
* To use register names with standard convension, please use CAN0_N1_TX_BRP.
*/
#define CAN0_TXBRP1 (CAN0_N1_TX_BRP)

/** \brief 6D0, Tx Buffer Add Request 1 */
#define CAN0_N1_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02086D0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BAR.
* To use register names with standard convension, please use CAN0_N1_TX_BAR.
*/
#define CAN0_TXBAR1 (CAN0_N1_TX_BAR)

/** \brief 6D4, Tx Buffer Cancellation Request 1 */
#define CAN0_N1_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02086D4u)
/** Alias (User Manual Name) for CAN0_N1_TX_BCR.
* To use register names with standard convension, please use CAN0_N1_TX_BCR.
*/
#define CAN0_TXBCR1 (CAN0_N1_TX_BCR)

/** \brief 6D8, Tx Buffer Transmission Occurred 1 */
#define CAN0_N1_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02086D8u)
/** Alias (User Manual Name) for CAN0_N1_TX_BTO.
* To use register names with standard convension, please use CAN0_N1_TX_BTO.
*/
#define CAN0_TXBTO1 (CAN0_N1_TX_BTO)

/** \brief 6DC, Tx Buffer Cancellation Finished 1 */
#define CAN0_N1_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02086DCu)
/** Alias (User Manual Name) for CAN0_N1_TX_BCF.
* To use register names with standard convension, please use CAN0_N1_TX_BCF.
*/
#define CAN0_TXBCF1 (CAN0_N1_TX_BCF)

/** \brief 6E0, Tx Buffer Transmission Interrupt Enable 1 */
#define CAN0_N1_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02086E0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BTIE.
* To use register names with standard convension, please use CAN0_N1_TX_BTIE.
*/
#define CAN0_TXBTIE1 (CAN0_N1_TX_BTIE)

/** \brief 6E4, Tx Buffer Cancellation Finished Interrupt Enable 1 */
#define CAN0_N1_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02086E4u)
/** Alias (User Manual Name) for CAN0_N1_TX_BCIE.
* To use register names with standard convension, please use CAN0_N1_TX_BCIE.
*/
#define CAN0_TXBCIE1 (CAN0_N1_TX_BCIE)

/** \brief 6F0, Tx Event FIFO Configuration 1 */
#define CAN0_N1_TX_EFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02086F0u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFC.
* To use register names with standard convension, please use CAN0_N1_TX_EFC.
*/
#define CAN0_TXEFC1 (CAN0_N1_TX_EFC)

/** \brief 6F4, Tx Event FIFO Status 1 */
#define CAN0_N1_TX_EFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02086F4u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFS.
* To use register names with standard convension, please use CAN0_N1_TX_EFS.
*/
#define CAN0_TXEFS1 (CAN0_N1_TX_EFS)

/** \brief 6F8, Tx Event FIFO Acknowledge 1 */
#define CAN0_N1_TX_EFA /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02086F8u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFA.
* To use register names with standard convension, please use CAN0_N1_TX_EFA.
*/
#define CAN0_TXEFA1 (CAN0_N1_TX_EFA)

/** \brief 900, Access Enable Register CAN Node 2 0 */
#define CAN0_N2_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0208900u)
/** Alias (User Manual Name) for CAN0_N2_ACCENNODE0.
* To use register names with standard convension, please use CAN0_N2_ACCENNODE0.
*/
#define CAN0_ACCENNODE20 (CAN0_N2_ACCENNODE0)

/** \brief 908, Start Address Node 2 */
#define CAN0_N2_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208908u)
/** Alias (User Manual Name) for CAN0_N2_STARTADR.
* To use register names with standard convension, please use CAN0_N2_STARTADR.
*/
#define CAN0_STARTADR2 (CAN0_N2_STARTADR)

/** \brief 90C, End Address Node 2 */
#define CAN0_N2_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF020890Cu)
/** Alias (User Manual Name) for CAN0_N2_ENDADR.
* To use register names with standard convension, please use CAN0_N2_ENDADR.
*/
#define CAN0_ENDADR2 (CAN0_N2_ENDADR)

/** \brief 910, Interrupt Signalling Register 2 */
#define CAN0_N2_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208910u)
/** Alias (User Manual Name) for CAN0_N2_ISREG.
* To use register names with standard convension, please use CAN0_N2_ISREG.
*/
#define CAN0_ISREG2 (CAN0_N2_ISREG)

/** \brief 914, Interrupt routing for Groups 1 2 */
#define CAN0_N2_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0208914u)
/** Alias (User Manual Name) for CAN0_N2_GRINT1.
* To use register names with standard convension, please use CAN0_N2_GRINT1.
*/
#define CAN0_GRINT12 (CAN0_N2_GRINT1)

/** \brief 918, Interrupt routing for Groups 2 2 */
#define CAN0_N2_GRINT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT2*)0xF0208918u)
/** Alias (User Manual Name) for CAN0_N2_GRINT2.
* To use register names with standard convension, please use CAN0_N2_GRINT2.
*/
#define CAN0_GRINT22 (CAN0_N2_GRINT2)

/** \brief 920, Node 2 Timer Clock Control Register */
#define CAN0_N2_NT_CCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0208920u)
/** Alias (User Manual Name) for CAN0_N2_NT_CCR.
* To use register names with standard convension, please use CAN0_N2_NT_CCR.
*/
#define CAN0_NTCCR2 (CAN0_N2_NT_CCR)

/** \brief 924, Node 2 Timer A Transmit Trigger Register */
#define CAN0_N2_NT_ATTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0208924u)
/** Alias (User Manual Name) for CAN0_N2_NT_ATTR.
* To use register names with standard convension, please use CAN0_N2_NT_ATTR.
*/
#define CAN0_NTATTR2 (CAN0_N2_NT_ATTR)

/** \brief 928, Node 2 Timer B Transmit Trigger Register */
#define CAN0_N2_NT_BTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0208928u)
/** Alias (User Manual Name) for CAN0_N2_NT_BTTR.
* To use register names with standard convension, please use CAN0_N2_NT_BTTR.
*/
#define CAN0_NTBTTR2 (CAN0_N2_NT_BTTR)

/** \brief 92C, Node 2 Timer C Transmit Trigger Register */
#define CAN0_N2_NT_CTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF020892Cu)
/** Alias (User Manual Name) for CAN0_N2_NT_CTTR.
* To use register names with standard convension, please use CAN0_N2_NT_CTTR.
*/
#define CAN0_NTCTTR2 (CAN0_N2_NT_CTTR)

